# IsValidMajorLapSplice Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricArea..::..IsValidMajorLapSplice Method
FabricArea Class See Also
---
Identifies if the specified value is valid for use as a major lap splice.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public bool IsValidMajorLapSplice(
	double majorLapSplice
)
```

Visual Basic
---
```text
Public Function IsValidMajorLapSplice ( _
	majorLapSplice As Double _
) As Boolean
```

Visual C++
---
```text
public:
bool IsValidMajorLapSplice(
	double majorLapSplice
)
```

# ### Parameters
majorLapSplice
    Type: System..::..Double The major lap splice value.
# ### Return Value
True if the value is valid, false if the value is invalid.
# Remarks
The major lap splice should be less than or equal to half of the overall length.
# See Also
FabricArea Class
Autodesk.Revit.DB.Structure Namespace